{
    "Account Takeover": [
        {
            "korean": "WordPress 플러그인 ACF 영향받는 버전에는 contributor 권한 이상의 사용자 정보 변경 권한이 없는 사용자가 다른 사용자의 메타 정보를 변경할 수 있는 취약점이 있습니다.",
            "english": "The plugin ACF Quick Edit Fields for WordPress is vulnerable to Insecure Direct Object Reference in versions up to, and including, 3.2.2. This makes it possible for attackers without the edit_users capability to access metadata of other users, this includes contributor-level users and above."
        },
        {
            "korean": "WordPress 플러그인 ProfileGrid 영향받는 버전에는 subscriber 권한 이상의 사용자가 다른 사용자의 정보를 업데이트할 수 있는 취약점이 있습니다.",
            "english": "The ProfileGrid plugin for WordPress is vulnerable to unauthorized modification of data due to a missing capability check on the 'pm_upload_csv' function in versions up to, and including, 5.5.1. This makes it possible for authenticated attackers, with subscriber-level permissions or above to import new users and update existing users."
        },
        {
            "korean": "Xpand IT Write-back manager 영향받는 버전에서는 라이센스 생성 또는 유효성을 검사할 때 사용하는 비밀키가 하드 코딩 되어있는 취약점이 있습니다.",
            "english": "Xpand IT Write-back manager v2.3.1 uses a hardcoded salt in license class configuration which leads to the generation of a hardcoded and predictable symmetric encryption keys for license generation and validation."
        },
        {
            "korean": "SonicOS SSLVPN 영향받는 버전에는 인증되지 않은 사용자가 다른 사용자의 인증 토큰을 탈취할 수 있는 취약점이 있습니다. 공격자는 토큰을 발급 할 때 사용하는 SEED 값을 무차별 대입하여 다른 사용자의 인증 토큰을 임의로 생성할 수 있습니다.",
            "english": "[DESC] Use of Cryptographically Weak Pseudo-Random Number Generator (PRNG) in the SonicOS SSLVPN authentication token generator that, in certain cases, can be predicted by an attacker potentially resulting in authentication bypass.\t"
        },
        {
            "korean": "WordPress 플러그인 OttoKit(SureTriggers) 영향받는 버전에서는 인증되지 않은 사용자가 관리자의 사용자명을 알고 있는 경우 임의의 비밀번호와 액세스 키로 API 연결을 생성하여 새로운 관리자 계정을 만들 수 있는 취약점이 있습니다.",
            "english": "Incorrect Privilege Assignment vulnerability in Brainstorm Force SureTriggers allows Privilege Escalation.This issue affects SureTriggers: from n/a through 1.0.82."
        }
    ],
    "Broken Access Control": [
        {
            "korean": "Ivanti CSA 영향받는 버전에는 인증되지 않은 사용자가 인증을 우회하여 관리자용 웹 콘솔에 접근할 수 있는 인증 우회 취약점이 있습니다.",
            "english": "[DESC] An authentication bypass in the admin web console of Ivanti CSA before 5.0.3 allows a remote unauthenticated attacker to gain administrative access"
        },
        {
            "korean": "Gen7 SonicOS Cloud Platform NSv 영향받는 버전에서는 낮은 권한을 가진 인증된 사용자가 root 권한으로 악성 코드를 실행할 수 있는 권한 상승 취약점이 있습니다.",
            "english": "[DESC] A vulnerability in the Gen7 SonicOS Cloud platform NSv, allows a remote authenticated local low-privileged attacker to elevate privileges to `root` and potentially lead to code execution."
        },
        {
            "korean": "WordPress 플러그인 RegistrationMagic 영향받는 버전에서는 접근 제어가 미흡하여 권한이 없는 사용자가 관리자 기능을 실행할 수 있는 취약점 있습니다.",
            "english": "In the RegistrationMagic plugin through 4.6.0.3 for WordPress, the user controller allows remote authenticated users (with minimal privileges) to elevate their privileges to administrator via class_rm_user_controller.php rm_user_edit."
        },
        {
            "korean": "Bludit CMS 영향받는 버전에서는 권한이 부여되지 않은 임의의 사용자가 /api/users/cupcake 경로의 role 매개변수를 변조하여 자신의 권한을 상위 권한으로 변경할 수 있는 권한 상승 취약점이 있습니다.",
            "english": "Permissions vulnerability found in Bludit CMS v.4.0.0 allows local attackers to escalate privileges via the role:admin parameter."
        },
        {
            "korean": "WordPress 플러그인 WebToffee 영향받는 버전에는 Backup & Migration 기능에 무단으로 접근할 수 있는 부적절한 접근 통제 취약점이 있습니다.",
            "english": "Permissions vulnerability found in Bludit CMS v.4.0.0 allows local attackers to escalate privileges via the role:admin parameter."
        },
        {
            "korean": "CrateDB 영향받는 버전에서는 콘솔 페이지에서 SQL 구문을 실행할 때 사용자의 권한이 제한되지 않는 부적절한 권한 관리 취약점이 있습니다. 이를 통해 공격자는 /console 경로의 query 매개변수를 통해 COPY FROM과 같은 SQL 함수를 사용하여 민감한 경로의 서버 파일 정보를 탈취할 수 있습니다.",
            "english": "CrateDB is a distributed SQL database that makes it simple to store and analyze massive amounts of data in real-time. There is a COPY FROM function in the CrateDB database that is used to import file data into database tables. This function has a flaw, and authenticated attackers can use the COPY FROM function to import arbitrary file content into database tables, resulting in information leakage. This vulnerability is patched in 5.3.9, 5.4.8, 5.5.4, and 5.6.1."
        },
        {
            "korean": "Graylog 영향받는 버전에서는 권한 있는 사용자가 /api/system/cluster_config/[class_Name] 경로의 class_Name 경로에 대해 유효성 검사가 수행되지 않는 취약점이 있습니다. 이를 통해 공격자는 java.io.File와 같은 클래스를 인스턴스화하여 임의의 파일을 읽을 수 있습니다.",
            "english": "Graylog is a free and open log management platform. Starting in version 2.0.0 and prior to versions 5.1.11 and 5.2.4, arbitrary classes can be loaded and instantiated using a HTTP PUT request to the `/api/system/cluster_config/` endpoint. Graylog's cluster config system uses fully qualified class names as config keys. To validate the existence of the requested class before using them, Graylog loads the class using the class loader. If a user with the appropriate permissions performs the request, arbitrary classes with 1-arg String constructors can be instantiated. This will execute arbitrary code that is run during class instantiation. In the specific use case of `java.io.File`, the behavior of the internal web-server stack will lead to information exposure by including the entire file content in the response to the REST request. Versions 5.1.11 and 5.2.4 contain a fix for this issue."
        },
        {
            "korean": "WordPress 플러그인 OttoKit(SureTriggers) 영향받는 버전에서는 secret_key가 설정되어 있지 않은 경우 인증되지 않은 사용자가 /wp-json/sure-triggers/v1/automation/action 경로에 st_authorization 헤더를 빈값으로 요청하여 인증을 우회하고 관리자 계정을 생성할 수 있는 취약점이 있습니다.",
            "english": "The SureTriggers: All-in-One Automation Platform plugin for WordPress is vulnerable to an authentication bypass leading to administrative account creation due to a missing empty value check on the 'secret_key' value in the 'autheticate_user' function in all versions up to, and including, 1.0.78. This makes it possible for unauthenticated attackers to create administrator accounts on the target website when the plugin is installed and activated but not configured with an API key."
        },
        {
            "korean": "WordPress 플러그인 Rank Math SEO 영향받는 버전에서는 메타데이터를 처리하는 과정에서 사용자 권한 검사가 누락된 부적절한 권한 검사 취약점이 있습니다. 이 취약점을 악용할 경우, 공격자가 메타데이터를 임의로 추가하거나 변경할 수 있으며, 메타데이터가 삭제될 경우 관리자 대시보드에 접근할 수 없게 될 수 있습니다.",
            "english": "The Rank Math SEO – AI SEO Tools to Dominate SEO Rankings plugin for WordPress is vulnerable to unauthorized modification and loss of data due to a missing capability check on the 'update_metadata' function in all versions up to, and including, 1.0.228. This makes it possible for unauthenticated attackers to insert new and update existing metadata beginning with 'rank_math', and delete arbitrary existing user metadata and term metadata. Deleting existing usermeta can cause a loss of access to the administrator dashboard for any registered users, including Administrators."
        },
        {
            "korean": "WordPress 플러그인 Read more By Adam 영향받는 버전에서는 Subscriber 권한 이상의 사용자가 read more 버튼을 UI에 출력하지 않도록 변경할 수 있는 부적절한 권한 검사 취약점이 있습니다. 이 취약점은 deleteRm 함수에서 발생합니다.",
            "english": "WordPress용 Read more By Adam 플러그인은 1.1.8 이하 모든 버전에서 deleteRm() 함수의 기능 검사가 누락되어 무단 데이터 손실에 취약합니다. 이로 인해 구독자 수준 이상의 권한을 가진 인증된 공격자가 Read more 버튼을 삭제할 수 있습니다."
        },
        {
            "korean": "WordPress 플러그인 WPDash Notes 영향받는 버전에서는 Subscriber 권한 이상의 인증된 사용자가 모든 게시물의 댓글을 열람할 수 있는 취약점이 있습니다. 해당 취약점은 wp_ajax_post_it_list_comment 함수에서 권한 검사가 누락되어 발생합니다.",
            "english": "The WPDash Notes plugin for WordPress is vulnerable to unauthorized access of data due to a missing capability check on the 'wp_ajax_post_it_list_comment' function in all versions up to, and including, 1.3.5. This makes it possible for authenticated attackers, with Subscriber-level access and above, to view comments on any post, including private and password protected posts, and pending and draft posts if they were previously published. The vulnerability was partially patched in version 1.3.5."
        },
        {
            "korean": "WordPress 플러그인 Popup Surveys & Polls for WordPress (Mare.io) 영향받는 버전에서는 올바르지 않은 보안 설정 레벨로 구성되어 있는 취약점이 있습니다. 이 취약점을 악용하는 경우 설문 조사 및 투표 기능에 영향을 줄 수 있습니다.",
            "english": "Missing Authorization vulnerability in dusthazard Popup Surveys & Polls for WordPress (Mare.io) allows Exploiting Incorrectly Configured Access Control Security Levels.This issue affects Popup Surveys & Polls for WordPress (Mare.io): from n/a through 1.36."
        }
    ],
    "Brute Force": [
        {
            "korean": "PiiGAB M-Bus 영향받는 버전에서는 사용자 패스워드 정책의 취약한 보안 설정으로 인해 무차별 대입 공격을 통한 계정 탈취가 가능한 취약점이 있습니다.",
            "english": "There are no requirements for setting a complex password for PiiGAB M-Bus, which could contribute to a successful brute force attack if the password is inline with recommended password guidelines."
        },
        {
            "korean": "kodbox 영향받는 버전에서는 로그인 페이지의 응답 메시지를 기반으로 사용자 계정을 유추할 수 있는 취약점이 있습니다. 해당 취약점을 악용하는 경우 서버에 존재하는 모든 사용자 계정을 열거할 수 있습니다.",
            "english": "kodbox 1.46.01 has a security flaw that enables user enumeration. This problem is present on the login page, where an attacker can identify valid users based on varying response messages, potentially paving the way for a brute force attack."
        },
        {
            "korean": "DECISO OPNsense 영향받는 버전에서는 로그인 페이지에 무차별 대입 공격을 시도하여 인증을 우회할 수 있는 취약점이 있습니다.",
            "english": "DECISO OPNsense 23.1 does not impose rate limits for authentication, allowing attackers to perform a brute-force attack to bypass authentication."
        }
    ],
    "Buffer overflow": [
        {
            "korean": "Milesight UR32L 영향받는 버전에서는 관리자 권한의 사용자가 /cgi 경로의 rule_name 매개변수에 768자 이상의 문자열을 추가하는 경우 버퍼오버플로우가 발생할 수 있는 취약점이 있습니다.",
            "english": "Multiple buffer overflow vulnerabilities exist in the vtysh_ubus binary of Milesight UR32L v32.3.0.5 due to the use of an unsafe sprintf pattern. A specially crafted HTTP request can lead to arbitrary code execution. An attacker with high privileges can send HTTP requests to trigger these vulnerabilities.This buffer overflow occurs in the set_qos function with the rule_name variable with two possible format strings."
        },
        {
            "korean": "FreeType 영향받는 버전에서는 TrueType GX 및 가변 글꼴 파일의 서브글리프(subglyph) 구조를 파싱할 때 발생하는 out-of-bounds 취약점이 있습니다.",
            "english": "An out of bounds write exists in FreeType versions 2.13.0 and below (newer versions of FreeType are not vulnerable) when attempting to parse font subglyph structures related to TrueType GX and variable font files. The vulnerable code assigns a signed short value to an unsigned long and then adds a static value causing it to wrap around and allocate too small of a heap buffer. The code then writes up to 6 signed long integers out of bounds relative to this buffer. This may result in arbitrary code execution. This vulnerability may have been exploited in the wild."
        }
    ],
    "Command Injection": [
        {
            "korean": "Crater 영향받는 버전에서는 관리자 권한의 사용자가 /api/v1/company/upload-logo 경로의 campny_logo 매개변수를 통해 임의의 PHP 코드를 실행할 수 있는 명령어 삽입 취약점이 있습니다.",
            "english": "/api/v1/company/upload-logo in CompanyController.php in crater through 6.0.6 allows a superadmin to execute arbitrary PHP code by placing this code into an image/png IDAT chunk of a Company Logo image."
        },
        {
            "korean": "reNgine 영향받는 버전에서는 인증된 사용자가 /api/tools/waf_detector 경로의 url 매개변수를 통해 임의의 OS 명령어를 삽입하여 실행할 수 있는 명령어 삽입 취약점이 있습니다.",
            "english": "reNgine through 2.0.2 allows OS Command Injection if an adversary has a valid session ID. The attack places shell metacharacters in an api/tools/waf_detector/?url= string. The commands are executed as root via subprocess.check_output."
        },
        {
            "korean": "Yii 영향받는 버전에서는 __class 배열 키로 정의된 behavior를 처리하는 과정에서 원격 명령이 실행될 수 있는 취약점이 있습니다. 해당 취약점은 CVE-2024-4990으로 등록되어 있으며 기존 CVE-2024-4990에 대한 수정 사항이 제대로 반영되지 않아 다시 발생한 회귀(regression) 취약점입니다.",
            "english": "Yii 2 before 2.0.52 mishandles the attaching of behavior that is defined by an __class array key, a CVE-2024-4990 regression, as exploited in the wild in February through April 2025."
        }
    ],
    "CRLF Injection": [
        {
            "korean": "Crow 패키지 영향받는 버전에서는 요청 매개변수에 CRLF(Carriage Return and Line Feed) 구문을 삽입하는 경우 시퀀스가 부적절하게 처리되어 HTTP Response Smuggling 공격이 가능한 취약점이 있습니다.",
            "english": "All versions of the package crow are vulnerable to HTTP Response Splitting when untrusted user input is used to build header values. Header values are not properly sanitized against CRLF Injection in the set_header and add_header functions. An attacker can add the \\r\\n (carriage return line feeds) characters to end the HTTP response headers and inject malicious content."
        },
        {
            "korean": "Undici 영향받는 버전에는 Host 헤더에 CRLF(Carriage Return and Line Feed) 주입을 통해 HTTP Request Smuggling이 가능한 취약점이 있습니다.",
            "english": "Undici is an HTTP/1.1 client for Node.js. Starting with version 2.0.0 and prior to version 5.19.1, the undici library does not protect `host` HTTP header from CRLF injection vulnerabilities. This issue is patched in Undici v5.19.1. As a workaround, sanitize the `headers.host` string before passing to undici."
        },
        {
            "korean": "Apache Flink Stateful Functions 영향받는 버전에서는 HTTP 요청 헤더의 CRLF(Carriage Return and Line Feed) 시퀀스가 부적절하게 처리되어 HTTP Response Smuggling 공격이 가능한 취약점이 있습니다.",
            "english": "Improper Neutralization of CRLF Sequences in HTTP Headers in Apache Flink Stateful Functions 3.1.0, 3.1.1 and 3.2.0 allows remote attackers to inject arbitrary HTTP headers and conduct HTTP response splitting attacks via crafted HTTP requests. Attackers could potentially inject malicious content into the HTTP response that is sent to the user's browser. Users should upgrade to Apache Flink Stateful Functions version 3.3.0."
        }
    ],
    "CSRF Injection": [
        {
            "korean": "WordPress 플러그인 AffiliateWP 영향받는 버전에는 subscriber 권한 이상의 사용자가 플러그인 상태를 변경하는 AJAX 요청에 대해 CSRF 공격이 가능한 취약점이 있습니다.",
            "english": "The AffiliateWP for WordPress is vulnerable to unauthorized modification of data due to a missing capability check on the 'affwp_activate_addons_page_plugin' function called via an AJAX action in versions up to, and including, 2.14.0. This makes it possible for authenticated attackers, with subscriber-level access and above, to activate arbitrary plugins."
        },
        {
            "korean": "WordPress 플러그인 Image Menu 영향받는 버전에서는 플러그인 설정을 변경하는 요청에 대해 CSRF 공격이 가능한 취약점이 있습니다. 관리자 권한의 사용자가 CSRF 공격에 노출되는 경우 XSS 구문을 플러그인 설정으로 추가할 수 있으며 이를 통해 2차 공격이 시도될 수 있습니다.",
            "english": "The Accordion Image Menu WordPress plugin through 3.1.3 does not have CSRF check in some places, and is missing sanitisation as well as escaping, which could allow attackers to make logged in admin add Stored XSS payloads via a CSRF attack."
        },
        {
            "korean": "FrogCMS 영향받는 버전에서는 /admin/?/page/add 경로에 CSRF 공격이 가능한 취약점이 있습니다. 관리자 권한의 사용자가 CSRF 공격에 노출되는 경우 의도하지 않게 새로운 페이지가 추가될 수 있습니다.",
            "english": "FrogCMS v0.9.5 was discovered to contain a Cross-Site Request Forgery (CSRF) vulnerability via /admin/?/page/add."
        }
    ],
    "CSV Injection": [
        {
            "korean": "WordPress 플러그인 WS Form LITE 영향받는 버전에는 인증되지 않은 사용자가 파일 내보내기 기능을 통해 악성 CSV 구문이 포함된 데이터를 다운로드 받을 수 있는 취약점이 있습니다.",
            "english": "The WS Form LITE plugin for WordPress is vulnerable to CSV Injection in versions up to, and including, 1.9.217. This allows unauthenticated attackers to embed untrusted input into exported CSV files, which can result in code execution when these files are downloaded and opened on a local system with a vulnerable configuration."
        }
    ],
    "Directory Listing": [
        {
            "korean": "WordPress 플러그인 Front End PM 영향받는 버전에서는 /wp-content/uploads/front-end-pm/2023/09/ 경로의 HTTP 요청을 통해 디렉터리에 포함된 파일과 폴더 목록이 노출되는 디렉토리 리스팅 취약점이 있습니다.",
            "english": "The Front End PM WordPress plugin before 11.4.3 does not block listing the contents of the directories where it stores attachments to private messages, allowing unauthenticated visitors to list and download private attachments if the autoindex feature of the web server is enabled."
        }
    ],
    "Directory Traversal": [
        {
            "korean": "Omni CMS 영향받는 버전에는 인증되지 않은 사용자가 dir 매개변수를 통해 서버의 폴더 구조에 대해 탐색이 가능한 디렉토리 트래버셜 취약점이 있습니다.",
            "english": "A Directory Traversal vulnerability in Modern Campus - Omni CMS 2023.1 allows a remote, unauthenticated attacker to enumerate file system information via the dir parameter to listing.php or rss.php."
        },
        {
            "korean": "WordPress 플러그인 Best WordPress Gallery 영향받는 버전에는 contributor 권한 이상의 사용자가 서버의 폴더 구조에 대해 탐색이 가능한 디렉토리 트래버셜 취약점이 있습니다.",
            "english": "The Best WordPress Gallery Plugin – FooGallery plugin for WordPress is vulnerable to Directory Traversal in all versions up to, and including, 2.4.26. This makes it possible for authenticated attackers, with contributor level or higher to read the contents of arbitrary folders on the server, which can contain sensitive information such as folder structure."
        },
        {
            "korean": "OpenText Directory Services 영향받는 버전에는 사용자가 서버의 폴더 구조에 대해 탐색이 가능한 디렉토리 트래버셜 취약점이 있습니다.",
            "english": "Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal') vulnerability in OpenText OpenText Directory Services allows Path Traversal.This issue affects OpenText Directory Services: from 16.4.2 before 24.1."
        },
        {
            "korean": "WebIQ Windows 버전에서는 /.webui 경로의 하위 경로에 디렉토리 트래버셜 구문을 삽입하여 서버의 폴더 구조에 대해 탐색이 가능한 취약점이 있습니다.",
            "english": "The Windows version of WebIQ 2.15.9 is affected by a directory traversal vulnerability that allows remote attackers to read any file on the system."
        }
    ],
    "DoS": [
        {
            "korean": "Apache Commons FileUpload 영향받는 버전에서는 사용자가 다수의 파일을 업로드하는 경우 이를 처리하는 과정에서 서비스 거부 공격(DoS)이 유발될 수 있는 취약점이 있습니다.",
            "english": "Apache Commons FileUpload before 1.5 does not limit the number of request parts to be processed resulting in the possibility of an attacker triggering a DoS with a malicious upload or series of uploads. Note that, like all of the file upload limits, the new configuration option (FileUploadBase#setFileCountMax) is not enabled by default and must be explicitly configured."
        },
        {
            "korean": "O-RAN Software Community 영향받는 버전에는 E2Manager API 요청을 통해 서비스 거부 공격(DoS)이 유발될 수 있는 취약점이 있습니다.",
            "english": "An issue was discovered in O-RAN Software Community ric-plt-e2mgr in the G-Release environment, allows remote attackers to cause a denial of service (DoS) via a crafted request to the E2Manager API component."
        },
        {
            "korean": "Cisco Meraki MX 및 Cisco Meraki Z 시리즈 장치의 영향받는 버전에서는 인증된 사용자가 서비스 거부(DoS) 상태를 유발할 수 있는 취약점이 있습니다. 이 취약점은 SSL VPN 세션을 설정할 때 변수가 초기화되지 않아 발생하며, 공격자가 조작된 속성을 포함해 세션을 설정할 경우 VPN 서버가 재시작될 수 있습니다.",
            "english": "A vulnerability in the Cisco AnyConnect VPN server of Cisco Meraki MX and Cisco Meraki Z Series devices could allow an authenticated, remote attacker to cause a denial of service (DoS) condition in the Cisco AnyConnect service on an affected device. To exploit this vulnerability, the attacker must have valid VPN user credentials on the affected device. This vulnerability exists because a variable is not initialized when an SSL VPN session is established. An attacker could exploit this vulnerability by supplying crafted attributes while establishing an SSL VPN session with an affected device. A successful exploit could allow the attacker to cause the Cisco AnyConnect VPN server to restart, resulting in the failure of the established SSL VPN sessions and forcing remote users to initiate a new VPN connection and reauthenticate. A sustained attack could prevent new SSL VPN connections from being established. Note: When the attack traffic stops, the Cisco AnyConnect VPN server recovers without manual intervention."
        },
        {
            "korean": "Cisco Enterprise Chat and Email (ECE) 영향받는 버전에서는 인증되지 않은 사용자가 채팅 메시지를 통해 서비스 거부 공격(DoS)를 유발할 수 있는 취약점이 있습니다. 이 취약점은 채팅 메시지에 대해 적절히 검증하지 않아 발생합니다.",
            "english": "A vulnerability in chat messaging features of Cisco Enterprise Chat and Email (ECE) could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition. This vulnerability is due to improper validation of user-supplied input to chat entry points. An attacker could exploit this vulnerability by sending malicious requests to a messaging chat entry point in the affected application. A successful exploit could allow the attacker to cause the application to stop responding, resulting in a DoS condition. The application may not recover on its own and may need an administrator to manually restart services to recover."
        }
    ],
    "File Download": [
        {
            "korean": "GDidees CMS 영향받는 버전에는 /_admin/backup.php 경로의 백업 기능은 소스 코드를 포함한 모든 관련 파일들을 백업 파일 형태로 무단으로 생성할 수 있는 취약점이 있습니다.",
            "english": "GDidees CMS v3.9.1 was discovered to contain a source code disclosure vulnerability by the backup feature which is accessible via /_admin/backup.php."
        },
        {
            "korean": "Jizhicms 영향받는 버전에는 /admin/c/PluginsController.php 경로의 download_url 매개변수를 통해 임의 파일을 다운로드할 수 있는 취약점이 있습니다.",
            "english": "Jizhicms v2.5 was discovered to contain an arbitrary file download vulnerability via the component /admin/c/PluginsController.php."
        },
        {
            "korean": "Laravel CMS 영향받는 버전에서는 관리자 권한의 사용자가 /files 경로의 download_file 매개변수를 통해 외부 서버의 파일을 서버의 컴퓨터에 다운로드할 수 있는 취약점이 있습니다.",
            "english": "File Upload vulnerability in Laravel CMS v.1.4.7 and before allows a remote attacker to execute arbitrary code via the shell.php a component."
        },
        {
            "korean": "Cisco의 Webex App 영향받는 버전에서는 사용자 정의 URL 파서를 통해 임의의 파일을 다운로드하도록 유도할 수 있는 취약점이 있습니다. 인증되지 않은 공격자는 악의적인 회의 초대 링크를 생성하고 배포하여 사용자가 원치 않는 파일을 다운로드하도록 만들 수 있습니다.",
            "english": "A vulnerability in the custom URL parser of Cisco Webex App could allow an unauthenticated, remote attacker to persuade a user to download arbitrary files, which could allow the attacker to execute arbitrary commands on the host of the targeted user. This vulnerability is due to insufficient input validation when Cisco Webex App processes a meeting invite link. An attacker could exploit this vulnerability by persuading a user to click a crafted meeting invite link and download arbitrary files. A successful exploit could allow the attacker to execute arbitrary commands with the privileges of the targeted user."
        }
    ],
    "File Inclusion": [
        {
            "korean": "Customer Support System 영향받는 버전에서는 /customer_support/index.php 경로의 page 매개변수를 통해 내부 PHP 파일을 포함할 수 있는 LFI(Local File Inclusion) 취약점이 있습니다.",
            "english": "A local file inclusion (LFI) in Customer Support System v1 allows attackers to include internal PHP files and gain unauthorized acces via manipulation of the page= parameter at /customer_support/index.php."
        },
        {
            "korean": "WordPress 플러그인 so-widgets-bundle 영향받는 버전에서는 관리자 권한의 사용자가 /site2/wp-admin/admin-ajax.php 경로의 widget 매개변수를 통해 서버 내 임의의 파일을 포함할 수 있는 LFI(Local File Inclusion) 취약점이 있습니다.",
            "english": "The SiteOrigin Widgets Bundle WordPress plugin before 1.51.0 does not validate user input before using it to generate paths passed to include function/s, allowing users with the administrator role to perform LFI attacks in the context of Multisite WordPress sites."
        }
    ],
    "HTTP Parameter Pollution": [
        {
            "korean": "HTTP 파라미터 오염 공격이 가능한 취약점이 있습니다.",
            "english": ""
        }
    ],
    "Insecure Deserialization": [
        {
            "korean": "Zhong Bang CRMEB 영향받는 버전에서는 /api/controller/v1/PublicController.php 경로에 직렬화된 데이터를 삽입하여 명령을 실행할 수 있는 안전하지 않은 역직렬화 취약점이 있습니다.",
            "english": "A vulnerability was found in Zhong Bang CRMEB up to 4.6.0. It has been declared as problematic. Affected by this vulnerability is the function put_image of the file api/controller/v1/PublicController.php. The manipulation leads to deserialization. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-231505 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
        },
        {
            "korean": "PublicCMS 영향받는 버전에서는 Java 객체를 삽입하여 원격 명령을 실행할 수 있는 안전하지 않은 역직렬화 취약점이 있습니다.",
            "english": "Deserialization of Untrusted Data in PublicCMS v.4.0.202302.e allows a remote attacker to execute arbitrary code via a crafted script to the writeReplace function."
        },
        {
            "korean": "Apache MINA 영향받는 버전에서는 직렬화된 데이터를 역직렬화 하는 과정에서 악성 코드를 실행할 수 있는 안전하지 않은 역직렬화 취약점이 있습니다. 해당 취약점은 ObjectSerializationDecoder 객체를 통해 발생합니다.",
            "english": "The ObjectSerializationDecoder in Apache MINA uses Java’s native deserialization protocol to processincoming serialized data but lacks the necessary security checks and defenses. This vulnerability allowsattackers to exploit the deserialization process by sending specially crafted malicious serialized data,potentially leading to remote code execution (RCE) attacks. This issue affects MINA core versions 2.0.X, 2.1.X and 2.2.X, and will be fixed by the releases 2.0.27, 2.1.10 and 2.2.4.It's also important to note that an application using MINA core library will only be affected if the IoBuffer#getObject() method is called, and this specific method is potentially called when adding a ProtocolCodecFilter instance using the ObjectSerializationCodecFactory class in the filter chain. If your application is specifically using those classes, you have to upgrade to the latest version of MINA core library.Upgrading will  not be enough: you also need to explicitly allow the classes the decoder will accept in the ObjectSerializationDecoder instance, using one of the three new methods: /**     * Accept class names where the supplied ClassNameMatcher matches for * deserialization, unless they are otherwise rejected. * * @param classNameMatcher the matcher to use */ public void accept(ClassNameMatcher classNameMatcher) /** * Accept class names that match the supplied pattern for * deserialization, unless they are otherwise rejected. * * @param pattern standard Java regexp */ public void accept(Pattern pattern) /** * Accept the wildcard specified classes for deserialization, * unless they are otherwise rejected. * * @param patterns Wildcard file name patterns as defined by * {@link org.apache.commons.io.FilenameUtils#wildcardMatch(String, String) FilenameUtils.wildcardMatch} */ public void accept(String... patterns)By default, the decoder will reject *all* classes that will be present in the incoming data.Note: The FtpServer, SSHd and Vysper sub-project are not affected by this issue."
        }
    ],
    "LDAP Injection": [
        {
            "korean": "WordPress 플러그인 Staff / Employee Business Directory for Active Directory 영향받는 버전에서는 XSS 구문이 포함된 레코드를 등록하여 Reflected XSS 공격 구문을 실행할 수 있는 취약점이 있습니다.",
            "english": "The Staff / Employee Business Directory for Active Directory WordPress plugin before 1.2.3 does not sanitize and escape data returned from the LDAP server before rendering it in the page, allowing users who can control their entries in the LDAP directory to inject malicious javascript which could be used against high-privilege users such as a site admin."
        }
    ],
    "Open Redirect": [
        {
            "korean": "Asp.Net Zero 영향받는 버전에는 Websocket 메시지를 통해 OpenRedirect 공격이 가능한 취약점이 있습니다.",
            "english": "An open redirect through HTML injection in user messages in Asp.Net Zero before 12.3.0 allows remote attackers to redirect targeted victims to any URL via the '<meta http-equiv=\"refresh\"' in the WebSocket messages."
        }
    ],
    "Privacy leak": [
        {
            "korean": "Mattermost 영향받는 버전에는 권한이 낮은 사용자가 다른 사용자의 ID를 알고 있는 경우 /plugins/focalboard/api/v2/users 엔드 포인트를 통해 다른 사용자의 개인정보를 무단으로 열람할 수 있는 취약점이 있습니다.",
            "english": "Mattermost fails to perform proper authorization in the /plugins/focalboard/api/v2/users endpoint allowing an attacker who is a guest user and knows the ID of another user to get their information (e.g. name, surname, nickname) via Mattermost Boards."
        },
        {
            "korean": "WordPress 플러그인 LearnPress 영향받는 버전에서는 subscriber 권한 이상의 사용자가 /wp-json/lp/v1/profile/course-tab의 userID 매개변수를 통해 다른 사용자의 세부 정보를 검색할 수 있는 IDOR 취약점이 있습니다.",
            "english": "The LearnPress plugin for WordPress is vulnerable to Insecure Direct Object Reference in all versions up to, and including, 4.2.5.7 via the /wp-json/lp/v1/profile/course-tab REST API due to missing validation on the 'userID' user controlled key. This makes it possible for authenticated attackers, with subscriber-level access and above, to retrieve the details of another user's course progress."
        },
        {
            "korean": "FOG 영향받는 버전에서는 /fog/service/hostinfo.php 경로 등 여러 경로의 mac 매개변수를 통해 AD 계정 정보와 같은 민감 정보를 무단으로 탈취할 수 있는 취약점이 있습니다.",
            "english": "FOG is a free open-source cloning/imaging/rescue suite/inventory management system. The hostinfo page has missing/improper access control since only the host's mac address is required to obtain the configuration information. This data can only be retrieved if a task is pending on that host. Otherwise, an error message containing \"Invalid tasking!\" will be returned. The domainpassword in the hostinfo dump is hidden even to authenticated users, as it is displayed as a row of asterisks when navigating to the host's Active Directory settings.  This vulnerability is fixed in 1.5.10.41."
        }
    ],
    "Request Smuggling": [
        {
            "korean": "Puma 웹서버 영향받는 버전에서는 Content-Length 요청 헤더값이 0인 헤더를 구문 분석 하는 과정에서 요청이 분리되는 HTTP Request Smuggling 공격이 가능한 취약점이 있습니다.",
            "english": "Puma is a Ruby/Rack web server built for parallelism. Prior to versions 6.3.1 and 5.6.7, puma exhibited incorrect behavior when parsing chunked transfer encoding bodies and zero-length Content-Length headers in a way that allowed HTTP request smuggling. Severity of this issue is highly dependent on the nature of the web site using puma is. This could be caused by either incorrect parsing of trailing fields in chunked transfer encoding bodies or by parsing of blank/zero-length Content-Length headers. Both issues have been addressed and this vulnerability has been fixed in versions 6.3.1 and 5.6.7. Users are advised to upgrade. There are no known workarounds for this vulnerability."
        },
        {
            "korean": "Apache HTTP Server 영향받는 버전에서는 응답 헤더에 특수문자를 삽입하여 HTTP 응답을 분리할 수 있는 HTTP Response Smuggling 취약점이 존재합니다.",
            "english": "HTTP Response Smuggling vulnerability in Apache HTTP Server via mod_proxy_uwsgi. This issue affects Apache HTTP Server: from 2.4.30 through 2.4.55. Special characters in the origin response header can truncate/split the response forwarded to the client."
        }
    ],
    "Server Side Request Forgery": [
        {
            "korean": "GitHub 저장소 plantuml 영향받는 버전에서는 임의의 매개변수를 통해 서버측에서 무단 요청을 보낼 수 있는 SSRF 취약점이 있습니다.\t",
            "english": "Server-Side Request Forgery (SSRF) in GitHub repository plantuml/plantuml prior to 1.2023.9.\t"
        }
    ],
    "Server Side Template Injection": [
        {
            "korean": "XWiki Platform 영향받는 버전에서는 view 권한이 있는 사용자가 Groovy, Python 또는 Velocity 코드를 실행할 수 있는 SSTI 취약점이 있습니다.",
            "english": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. In affected versions any user with view rights can execute arbitrary Groovy, Python or Velocity code in XWiki leading to full access to the XWiki installation. The root cause is improper escaping of UIX parameters. A proof of concept exploit is to log in, add an `XWiki.UIExtensionClass` xobject to the user profile page, with an Extension Parameters content containing `label={{/html}} {{async async=\"true\" cached=\"false\" context=\"doc.reference\"}}{{groovy}}println(\"Hello \" + \"from groovy!\"){{/groovy}}{{/async}}`. Then, navigating to `PanelsCode.ApplicationsPanelConfigurationSheet` (i.e., `<xwiki-host>/xwiki/bin/view/PanelsCode/ApplicationsPanelConfigurationSheet` where `<xwiki-host>` is the URL of your XWiki installation) should not execute the Groovy script. If it does, you will see `Hello from groovy!` displayed on the screen. This vulnerability has been patched in XWiki 13.10.11, 14.4.7 and 14.10-rc-1. Users are advised to upgrade. For users unable to upgrade the issue can be fixed by editing the `PanelsCode.ApplicationsPanelConfigurationSheet` wiki page and making the same modifications as shown in commit `6de5442f3c`."
        },
        {
            "korean": "Fides 영향받는 버전에서는 Owner 또는 Contributor 권한을 가진 인증된 사용자가 /api/v1/messaging/templates 경로의 body 매개변수를 통해 SSTI 구문을 삽입할 수 있는 취약점이 있습니다.",
            "english": "Fides is an open-source privacy engineering platform. Starting in version 2.19.0 and prior to version 2.44.0, the Email Templating feature uses Jinja2 without proper input sanitization or rendering environment restrictions, allowing for Server-Side Template Injection that grants Remote Code Execution to privileged users. A privileged user refers to an Admin UI user with the default `Owner` or `Contributor` role, who can escalate their access and execute code on the underlying Fides Webserver container where the Jinja template rendering function is executed. The vulnerability has been patched in Fides version `2.44.0`. Users are advised to upgrade to this version or later to secure their systems against this threat. There are no workarounds."
        }
    ],
    "SQL Injection": [
        {
            "korean": "Tyk Gateway 영향받는 버전에서는 /api/errors/count 경로의 api_id 매개변수를 통해 SQL 구문을 삽입할 수 있는 취약점이 있습니다.",
            "english": "Blind SQL injection in api_id parameter in Tyk Gateway version 5.0.3 allows attacker to access and dump the database via a crafted SQL query."
        },
        {
            "korean": "PHPGurukul Small CRM 영향받는 버전에서는 사용자 로그인 페이지의 password 매개변수를 통해 SQL 구문을 삽입할 수 있는 취약점이 있습니다.",
            "english": "PHPGurukul Small CRM 3.0 is vulnerable to SQL Injection on the Users login panel because of \"password\" parameter is directly used in the SQL query without any sanitization and the SQL Injection payload being executed."
        },
        {
            "korean": "CrateDB 영향받는 버전에서는 콘솔 페이지에서 SQL 구문을 실행할 때 사용자의 권한이 제한되지 않는 부적절한 권한 관리 취약점이 있습니다. 이를 통해 공격자는 /console 경로의 query 매개변수를 통해 COPY FROM과 같은 SQL 함수를 사용하여 민감한 경로의 서버 파일 정보를 탈취할 수 있습니다.",
            "english": "CrateDB is a distributed SQL database that makes it simple to store and analyze massive amounts of data in real-time. There is a COPY FROM function in the CrateDB database that is used to import file data into database tables. This function has a flaw, and authenticated attackers can use the COPY FROM function to import arbitrary file content into database tables, resulting in information leakage. This vulnerability is patched in 5.3.9, 5.4.8, 5.5.4, and 5.6.1."
        },
        {
            "korean": "WordPress 플러그인 Product Labels For Woocommerce 영향받는 버전에서는 Blind SQL 구문을 삽입할 수 있는 취약점이 있습니다.",
            "english": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection') vulnerability in Acowebs Product Labels For Woocommerce allows Blind SQL Injection.This issue affects Product Labels For Woocommerce: from n/a through 1.5.8."
        }
    ],
    "Type Juggling": [
        {
            "korean": "OOO 영향받는 버전에는 PHP 느슨한 비교 연산을 하는 타입 변환 취약점 (PHP Type juggling) 취약점이 있습니다.",
            "english": ""
        }
    ],
    "Upload Insecure Files": [
        {
            "korean": "WordPress 플러그인 Jeg Elementor Kit 영향받는 버전에서는 Author 권한 이상의 인증된 사용자가 XSS 구문이 포함된 SVG 파일을 업로드하여 Stored Cross-Site Scripting (XSS) 구문을 삽입할 수 있는 취약점이 있습니다.",
            "english": "The Jeg Elementor Kit plugin for WordPress is vulnerable to Stored Cross-Site Scripting via SVG File uploads in all versions up to, and including, 2.6.7 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with Author-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses the SVG file."
        },
        {
            "korean": "Studio-42 eLfinder 영향받는 버전에서는 파일 업로드 기능을 통해 php8 확장자 파일을 업로드할 수 있는 취약점이 있습니다. 이러한 취약점을 악용하는 경우 Remote Code Execution (RCE) 공격을 위한 악성 파일을 업로드할 수 있습니다.",
            "english": "Studio-42 eLfinder 2.1.62 is vulnerable to Remote Code Execution (RCE) as there is no restriction for uploading files with the .php8 extension."
        },
        {
            "korean": "WordPress 플러그인 Everest Backup 영향받는 버전에는 관리자 권한의 사용자가 Restore 플러그인 설정 페이지의 백업 파일 업로드 기능을 통해 php 확장자 파일을 업로드할 수 있는 취약점이 있습니다.",
            "english": "The Everest Backup WordPress plugin before 2.2.5 does not properly validate backup files to be uploaded, allowing high privilege users such as admin to upload arbitrary files on the server even when they should not be allowed to (for example in multisite setup)"
        },
        {
            "korean": "Talend Data Catalog remote harvesting server 영향받는 버전에서는 인증되지 않은 사용자가 /upgrade 엔드 포인트를 통해 인증되지 않은 WAR 파일을 업로드하고 배포할 수 있는 취약점이 있습니다.",
            "english": "Talend Data Catalog remote harvesting server before 8.0-20230413 contains a /upgrade endpoint that allows an unauthenticated WAR file to be deployed on the server. (A mitigation is that the remote harvesting server should be behind a firewall that only allows access to the Talend Data Catalog server.)"
        },
        {
            "korean": "Apache Struts 영향받는 버전에는 인증되지 않은 사용자가 파일 업로드 기능을 통해 임의의 경로에 악성 파일을 업로드 할 수 있는 취약점이 있습니다. 공격자는 특정 매개변수에 디렉토리 트래버셜 구문을 삽입하여 업로드 경로를 변경할 수 있습니다.",
            "english": "File upload logic in Apache Struts is flawed. An attacker can manipulate file upload params to enable paths traversal and under some circumstances this can lead to uploading a malicious file which can be used to perform Remote Code Execution.This issue affects Apache Struts: from 2.0.0 before 6.4.0.Users are recommended to upgrade to version 6.4.0 at least and migrate to the new file upload mechanism https://struts.apache.org/core-developers/file-upload . If you are not using an old file upload logic based on FileuploadInterceptor your application is safe.You can find more details in  https://cwiki.apache.org/confluence/display/WW/S2-067"
        },
        {
            "korean": "Cleo Harmony, VLTrader, LexiCom 영향받는 버전에서는 인증되지 않은 사용자가 파일 업로드 기능을 통해 Autorun 디렉토리의 기본 설정을 변조할 수 있는 취약점이 있습니다. 공격자가 기본 설정 변조를 통해 임의의 OS 명령어를 실행할 수 있습니다.",
            "english": "In Cleo Harmony before 5.8.0.24, VLTrader before 5.8.0.24, and LexiCom before 5.8.0.24, an unauthenticated user can import and execute arbitrary Bash or PowerShell commands on the host system by leveraging the default settings of the Autorun directory."
        },
        {
            "korean": "TestLink 영향받는 버전에서는 파일 이름을 XSS 구문으로 변조하여 업로드하는 경우 파일 이름의 유효성을 검사하는 과정에서 발생하는 에러를 통해 XSS 구문을 실행할 수 있는 취약점이 있습니다.",
            "english": "TestLink before v.1.9.20 is vulnerable to Cross Site Scripting (XSS) via the pop-up on upload file. When uploading a file, the XSS payload can be entered into the file name."
        },
        {
            "korean": "Novel-Plus 영향받는 버전에는 filePath 또는 fileName 매개변수를 변조하여 악성 파일을 업로드할 수 있는 취약점이 있습니다. 해당 취약점은 FileController: fileDownload 함수에서 발생합니다.",
            "english": "An arbitrary File download vulnerability exists in Novel-Plus v4.3.0-RC1 and prior at com.java2nb.common.controller.FileController: fileDownload(). An attacker can pass in specially crafted filePath and fieName parameters to perform arbitrary File download."
        },
        {
            "korean": "Engineers Online Portal 영향받는 버전에서는 사용자 아바타 이미지를 변경할 때 업로드되는 이미지 파일에 대해 파일 크기를 제한하지 않는 취약점이 있습니다. 이러한 취약점을 악용하는 경우 서버의 스토리지 자원이 고갈될 수 있습니다.",
            "english": "A vulnerability was found in SourceCodester Engineers Online Portal 1.0. It has been classified as problematic. Affected is an unknown function of the component File Upload Handler. The manipulation leads to resource consumption. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-250116."
        },
        {
            "korean": "DedeBIZ 영향받는 버전에서는 /admin/media_add.php 경로의 파일 업로드 기능을 통해 phtml와 같은 확장자 파일을 업로드할 수 있는 취약점이 있습니다. 이 취약점은 업로드 파일에 대한 콘텐츠 유형과 파일 확장자가 일치하는지 확인하지 않아 발생합니다.",
            "english": "A vulnerability was found in DedeBIZ 6.3.0. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file admin/media_add.php of the component File Extension Handler. The manipulation of the argument upfile1 leads to unrestricted upload. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
        },
        {
            "korean": "Laravel Accounting System 영향받는 버전에서는 /app/Http/Controllers/HomeController.php 경로의 파일 업로드 기능을 통해 php와 같은 확장자 파일을 업로드할 수 있는 취약점이 있습니다. 이 취약점은 업로드 파일에 대한 콘텐츠 유형과 파일 확장자가 일치하는지 확인하지 않아 발생합니다.",
            "english": "A vulnerability, which was classified as critical, was found in itsourcecode Laravel Accounting System 1.0. This affects an unknown part of the file app/Http/Controllers/HomeController.php. The manipulation of the argument image leads to unrestricted upload. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-273621 was assigned to this vulnerability."
        },
        {
            "korean": "WordPress 플러그인 Insert or Embed Articulate Content 영향받는 버전에서는 Author 권한의 사용자가 e-Learning 위젯을 추가할 때 업로드되는 Articulate zip 파일에 대하여 검증이 부족한 취약점이 있습니다. 이러한 취약점을 악용하는 사용자는 PHP 파일을 Articulate zip 파일처럼 압축하여 업로드하고 임의의 코드를 실행할 수 있습니다.",
            "english": "The Insert or Embed Articulate Content into WordPress plugin before 4.3000000024 does not prevent authors from uploading arbitrary files to the site, which may allow them to upload PHP shells on affected sites."
        }
    ],
    "Web Cache Deception": [
        {
            "korean": "Cisco Unified Contact Center Express Finesse Portal 영향받는 버전에서는 인증되지 않은 사용자가 웹 캐시 오염(Web Cache Poisoning) 공격을 통해 다른 사용자들에게 악성 콘텐츠를 전달할 수 있는 취약점이 있습니다.",
            "english": ""
        },
        {
            "korean": "Cisco Unified Contact Center Express Finesse Portal 영향받는 버전에는 인증되지 않은 공격자는 웹 캐시를 조작하여 정상적인 사용자들에게 변조된 콘텐츠를 제공할 수 있는 취약점이 있습니다.",
            "english": ""
        }
    ],
    "XML Vulnerability": [
        {
            "korean": "Typecho 영향받는 버전에서는 /index.php/action/xmlrpc 경로의 RPC 요청을 통해 시스템 과부하를 유발할 수 있는 XML 구문을 삽입하여 서비스 거부 공격(DoS)를 유발할 수 있는 취약점이 있습니다.",
            "english": "Typecho v1.2.1 was discovered to be vulnerable to an XML Quadratic Blowup attack via the component /index.php/action/xmlrpc."
        },
        {
            "korean": "Mojoportal 영향받는 버전에서는 인증된 사용자가 임의의 매개변수를 통해 XML 외부 항목 삽입 (XXE) 공격이 가능한 취약점이 있습니다.",
            "english": "Mojoportal v2.7 was discovered to contain an authenticated XML external entity (XXE) injection vulnerability."
        }
    ],
    "XSS Injection": [
        {
            "korean": "WordPress 플러그인 WooCommerce 영향받는 버전에서는 인증되지 않은 사용자가 주문 양식을 통해 Reflected XSS 공격 구문을 실행할 수 있는 취약점이 있습니다.",
            "english": ""
        },
        {
            "korean": "Adobe Experience Manager 영향받는 버전에서는 낮은 권한의 사용자가 임의의 폼 필드를 통해 Stored Cross-Site Scripting (XSS) 구문을 삽입할 수 있는 취약점이 있습니다.",
            "english": ""
        },
        {
            "korean": "GLPI 영향받는 버전에서는 인증되지 않은 사용자가 검색 페이지를 통해 Reflected XSS 공격 구문을 실행할 수 있는 취약점이 있습니다.",
            "english": "GLPI is a free asset and IT management software package. Starting in version 9.4.0 and prior to version 10.0.8, a malicious link can be crafted by an unauthenticated user that can exploit a reflected XSS in case any authenticated user opens the crafted link. Users should upgrade to version 10.0.8 to receive a patch."
        },
        {
            "korean": "WordPress 플러그인 Quick Code 영향받는 버전에는 관리자 권한의 사용자가 플러그인 설정 페이지를 통해 Stored Cross-Site Scripting (XSS) 구문을 삽입할 수 있는 취약점이 있습니다. 해당 설정 페이지는 CSRF 검증이 미흡하여 관리자 권한의 사용자가 자신의 의도와 무관하게 XSS 구문을 삽입하도록 유도할 수 있습니다.",
            "english": "The Quick Code WordPress plugin through 1.0 does not have CSRF check in some places, and is missing sanitisation as well as escaping, which could allow attackers to make logged in admin add Stored XSS payloads via a CSRF attack."
        },
        {
            "korean": "LibreNMS 영향받는 버전에서는 관리자 권한의 사용자가 Display Name 편집 페이지의 Display Name 입력 폼 필드를 통해 Stored Cross-Site Scripting (XSS) 구문을 삽입할 수 있는 취약점이 있습니다.",
            "english": "LibreNMS is an open-source, PHP/MySQL/SNMP-based network monitoring system. User with Admin role can edit the Display Name of a device, the application did not properly sanitize the user input in the device Display Name, if java script code is inside the name of the device Display Name, its can be trigger from different sources. This vulnerability is fixed in 24.10.0."
        },
        {
            "korean": "Adobe Experience Manager 영향받는 버전에서는 권한이 낮은 사용자가 임의의 폼 필드를 통해 DOM-based Cross-Site Scripting (XSS) 구문을 삽입할 수 있는 취약점이 있습니다.",
            "english": "Adobe Experience Manager versions 6.5.18 and earlier are affected by a Cross-site Scripting (DOM-based XSS) vulnerability. If a low-privileged attacker is able to convince a victim to visit a URL referencing a vulnerable page, malicious JavaScript content may be executed within the context of the victim's browser."
        }
    ],
    "etc": [
        {
            "korean": "GitHub 저장소 froxlor/froxlor 영향받는 버전에서는 계정 비밀번호에 대한 보안 수준이 낮은 취약점이 있습니다.",
            "english": "Weak Password Requirements in GitHub repository froxlor/froxlor prior to 2.0.10."
        },
        {
            "korean": "Shopware 영향받는 버전에서는 로그아웃한 사용자 계정에 대한 세션 만료 기간이 1주일 이상 유지되는 불충분한 세션 만료 취약점이 있습니다.",
            "english": "Shopware is an open source commerce platform based on Symfony Framework and Vue js. The Administration session expiration was set to one week, when an attacker has stolen the session cookie they could use it for a long period of time. In version 6.4.18.1 an automatic logout into the Administration session has been added. As a result the user will be logged out when they are inactive. Users are advised to upgrade. There are no known workarounds for this issue."
        },
        {
            "korean": "Apache Tomcat 영향받는 버전에는 서블렛 write 기능이 활성화된 경우 업로드된 파일을 처리하는 과정에서 Time-of-check Time-of-use (TOCTOU) Race Condition 취약점이 발생할 수 있습니다. 이러한 취약점을 악용하는 경우 악성파일이 업로드 될 수 있습니다. ",
            "english": "Time-of-check Time-of-use (TOCTOU) Race Condition vulnerability during JSP compilation in Apache Tomcat permits an RCE on case insensitive file systems when the default servlet is enabled for write (non-default configuration).This issue affects Apache Tomcat: from 11.0.0-M1 through 11.0.1, from 10.1.0-M1 through 10.1.33, from 9.0.0.M1 through 9.0.97.Users are recommended to upgrade to version 11.0.2, 10.1.34 or 9.0.98, which fixes the issue."
        },
        {
            "korean": "Agile-Board 영향받는 버전에서는 비밀번호 재설정 링크를 생성하는 요청에서 호스트 헤더를 외부 도메인으로 변조하는 경우 악성 비밀번호 재설정 링크가 생성될 수 있는 취약점이 있습니다. 이러한 취약점을 악용하는 경우 비밀번호 재설정 링크를 통해 외부 도메인으로 비밀번호 재설정 토큰이 노출될 수 있습니다.",
            "english": "A Host header injection vulnerability in Agile-Board 1.0 allows attackers to obtain the password reset token via user interaction with a crafted password reset link."
        }
    ]
}